In [1]:
# Twilio App

In [134]:
from datetime import datetime, timedelta

In [79]:
new_shit = pd.read_csv('https://raw.githubusercontent.com/nytimes/covid-19-data/master/us-counties.csv')
new_shit.shape

(933498, 6)

In [135]:
new_shit['date'] = pd.to_datetime(new_shit['date'])

In [143]:
new_shit.head()

        date     county       state     fips  cases  deaths
0 2020-01-21  Snohomish  Washington  53061.0      1     0.0
1 2020-01-22  Snohomish  Washington  53061.0      1     0.0
2 2020-01-23  Snohomish  Washington  53061.0      1     0.0
3 2020-01-24       Cook    Illinois  17031.0      1     0.0
4 2020-01-24  Snohomish  Washington  53061.0      1     0.0

In [144]:
last_day = new_shit['date'].max().date()

In [145]:
last_day

datetime.date(2021, 1, 15)

In [146]:
day_before = val - timedelta(days=1)
day_before

datetime.date(2021, 1, 14)

In [153]:
last_day.strftime("%Y-%m-%d")

'2021-01-15'

In [168]:
import pandas as pd
pd.options.mode.chained_assignment = None  # default='warn

In [179]:
data_15 = new_shit[new_shit['date'] == last_day.strftime("%Y-%m-%d")]

In [181]:
data_15.drop(columns = ['fips', 'date'], inplace = True)

In [182]:
data_15.set_index(['county', 'state'], inplace=True)

In [183]:
data_14 = new_shit[new_shit['date'] == day_before.strftime("%Y-%m-%d")]

In [184]:
data_14.drop(columns = ['fips', 'date'], inplace = True)

In [185]:
data_14.set_index(['county', 'state'], inplace=True)

In [189]:
data_15

                    cases  deaths
county     state
Autauga    Alabama   5103    55.0
Baldwin    Alabama  16002   179.0
Barbour    Alabama   1712    36.0
Bibb       Alabama   2130    47.0
Blount     Alabama   5264    83.0
...                   ...     ...
Sweetwater Wyoming   3262    26.0
Teton      Wyoming   2605     4.0
Uinta      Wyoming   1806     9.0
Washakie   Wyoming    839    23.0
Weston     Wyoming    602     4.0

[3245 rows x 2 columns]

In [191]:
data_14

                    cases  deaths
county     state
Autauga    Alabama   5075    55.0
Baldwin    Alabama  15841   177.0
Barbour    Alabama   1696    36.0
Bibb       Alabama   2113    47.0
Blount     Alabama   5219    80.0
...                   ...     ...
Sweetwater Wyoming   3250    26.0
Teton      Wyoming   2579     4.0
Uinta      Wyoming   1794     9.0
Washakie   Wyoming    836    23.0
Weston     Wyoming    602     4.0

[3245 rows x 2 columns]

In [192]:
data_15-data_14

                    cases  deaths
county     state
Autauga    Alabama     28     0.0
Baldwin    Alabama    161     2.0
Barbour    Alabama     16     0.0
Bibb       Alabama     17     0.0
Blount     Alabama     45     3.0
...                   ...     ...
Sweetwater Wyoming     12     0.0
Teton      Wyoming     26     0.0
Uinta      Wyoming     12     0.0
Washakie   Wyoming      3     0.0
Weston     Wyoming      0     0.0

[3245 rows x 2 columns]

In [75]:
# from twilio.rest import Client

# # Your Account SID from twilio.com/console
# account_sid = "AC2fbfcb63a879cbc501befbcbc617bead"
# # Your Auth Token from twilio.com/console
# auth_token  = "d420c43055963f79061b79431a4fc190"

# client = Client(account_sid, auth_token)



# message = client.messages.create(
#     to="+18589242057", 
#     from_="+16264953242",
#     body="Cumulative COVID Cases: " + str(user_cases) + "\n" + "Cumulative COVID Deaths: " + str(user_deaths))

# print(message.sid)

SM2b101b2ddedc44a68aafbed7462c22ce